#### Terraform Format 🖌 `success`
#### Terraform Init ⚙️ `success`
#### Terraform Validate 🤖 `success`
#### Terraform Plan 📖 `failure`

<details><summary>Show Plan</summary>

```terraform
null_resource.k3s_server: Refreshing state... [id=2615270924932933223]
module.phases.random_id.infisical_jwt_mfa_secret: Refreshing state... [id=uiiAmAWP_qOj0Pc9dXiD8w]
local_sensitive_file.ssh_key: Refreshing state... [id=f6bef8bf75abefb62ee12a1e5d4dc5fffd3bede3]
module.phases.random_id.infisical_jwt_signup_secret: Refreshing state... [id=wtbRhalfsA_I--VjJqutQg]
module.phases.random_id.infisical_jwt_service_secret: Refreshing state... [id=KaSRckpF-OMzqg_5XfWLLQ]
module.phases.random_id.infisical_jwt_provider_secret: Refreshing state... [id=p9dtILHmh7WIC--X7bOnkg]
module.phases.random_id.infisical_encryption_key: Refreshing state... [id=YnFeetTGHyJez_MYN6nBBA]
module.phases.random_id.infisical_jwt_auth_secret: Refreshing state... [id=EvXYWZq0bw7nLwfKJWZvmQ]
module.phases.random_id.infisical_jwt_refresh_secret: Refreshing state... [id=fbkx50QzbF3-goKz0CM4WQ]
module.phases.kubernetes_namespace.iac: Refreshing state... [id=iac]
module.phases.kubernetes_namespace.dashboard: Refreshing state... [id=kubernetes-dashboard]
null_resource.kubeconfig: Refreshing state... [id=5604060404043419012]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # local_sensitive_file.ssh_key will be created
  + resource "local_sensitive_file" "ssh_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "/tmp/infra-k3s.id_rsa"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @wangzitian0, Action: `pull_request`*